{
  "question": [
    {
      "question_number": 1,
      "question": "Trong bối cảnh lịch sử của Cách mạng tháng Tám năm 1945, sự kiện nào đã tạo ra thời cơ 'ngàn năm có một' để nhân dân Việt Nam đứng lên giành chính quyền?",
      "answeroption": [
        {
          "text": "Nhật đảo chính Pháp trên toàn Đông Dương (3-1945).",
          "rationale": "Sai. Sự kiện này chỉ tạo ra tiền đề, chưa phải là thời cơ chín muồi nhất.",
          "isCorrect": false
        },
        {
          "text": "Phát xít Đức đầu hàng Đồng minh không điều kiện (5-1945).",
          "rationale": "Sai. Đây là điều kiện ở châu Âu, chưa tác động trực tiếp ngay lập tức đến Đông Dương như sự kiện Nhật đầu hàng.",
          "isCorrect": false
        },
        {
          "text": "Nhật Bản đầu hàng Đồng minh không điều kiện (8-1945).",
          "rationale": "Đúng. Việc Nhật đầu hàng khiến quân Nhật ở Đông Dương hoang mang, chính phủ tay sai rệu rã, tạo thời cơ thuận lợi nhất.",
          "isCorrect": true
        },
        {
          "text": "Mặt trận Việt Minh ra đời (1941).",
          "rationale": "Sai. Đây là sự chuẩn bị về lực lượng, không phải là yếu tố khách quan tạo thời cơ.",
          "isCorrect": false
        }
      ],
      "hint": "Đây là sự kiện khách quan diễn ra vào giữa tháng 8 năm 1945 liên quan đến tình hình Chiến tranh thế giới thứ hai."
    },
    {
      "question_number": 2,
      "question": "Bốn tỉnh nào giành được chính quyền sớm nhất trong cả nước (vào ngày 18-8-1945)?",
      "answeroption": [
        {
          "text": "Hà Nội, Huế, Sài Gòn, Bắc Giang.",
          "rationale": "Sai. Hà Nội (19/8), Huế (23/8), Sài Gòn (25/8).",
          "isCorrect": false
        },
        {
          "text": "Bắc Giang, Hải Dương, Hà Tĩnh, Quảng Nam.",
          "rationale": "Đúng. Theo SGK trang 35, nhân dân 4 tỉnh này đã giành chính quyền sớm nhất trong cả nước vào ngày 18-8-1945.",
          "isCorrect": true
        },
        {
          "text": "Thái Nguyên, Tuyên Quang, Hà Nội, Hải Dương.",
          "rationale": "Sai. Thái Nguyên giải phóng thị xã ngày 16/8 nhưng chưa phải là tỉnh giành chính quyền trọn vẹn sớm nhất.",
          "isCorrect": false
        },
        {
          "text": "Hải Dương, Quảng Ngãi, Bình Định, Bắc Giang.",
          "rationale": "Sai. Quảng Ngãi và Bình Định không nằm trong nhóm 4 tỉnh đầu tiên.",
          "isCorrect": false
        }
      ],
      "hint": "Đây là 4 địa phương đã chớp thời cơ giành chính quyền ngay trước khi cuộc khởi nghĩa ở Hà Nội thắng lợi."
    },
    {
      "question_number": 3,
      "question": "Sự kiện nào đánh dấu chế độ phong kiến Việt Nam hoàn toàn sụp đổ trong Cách mạng tháng Tám năm 1945?",
      "answeroption": [
        {
          "text": "Vua Bảo Đại tuyên bố thoái vị (30-8-1945).",
          "rationale": "Đúng. Sự kiện vua Bảo Đại thoái vị và trao ấn kiếm cho đại diện chính phủ lâm thời đánh dấu sự sụp đổ của chế độ phong kiến.",
          "isCorrect": true
        },
        {
          "text": "Khởi nghĩa giành thắng lợi ở Huế (23-8-1945).",
          "rationale": "Sai. Đây là thắng lợi của khởi nghĩa tại địa phương, chưa phải là mốc chấm dứt pháp lý của triều đình phong kiến.",
          "isCorrect": false
        },
        {
          "text": "Chủ tịch Hồ Chí Minh đọc Tuyên ngôn Độc lập (2-9-1945).",
          "rationale": "Sai. Đây là sự kiện khai sinh ra nước Việt Nam Dân chủ Cộng hòa.",
          "isCorrect": false
        },
        {
          "text": "Uỷ ban Dân tộc giải phóng Việt Nam cải tổ thành Chính phủ lâm thời (28-8-1945).",
          "rationale": "Sai. Đây là sự kiện về tổ chức bộ máy nhà nước mới.",
          "isCorrect": false
        }
      ],
      "hint": "Sự kiện diễn ra tại Ngọ Môn (Huế) khi vị vua cuối cùng của triều Nguyễn trao ấn kiếm cho cách mạng."
    },
    {
      "question_number": 4,
      "question": "Nội dung nào sau đây KHÔNG phải là nguyên nhân thắng lợi của Cách mạng tháng Tám năm 1945?",
      "answeroption": [
        {
          "text": "Sự lãnh đạo đúng đắn, sáng tạo của Đảng Cộng sản Đông Dương.",
          "rationale": "Sai. Đây là nguyên nhân chủ quan hàng đầu.",
          "isCorrect": false
        },
        {
          "text": "Truyền thống yêu nước nồng nàn, tinh thần đoàn kết của nhân dân ta.",
          "rationale": "Sai. Đây là nguyên nhân chủ quan quan trọng.",
          "isCorrect": false
        },
        {
          "text": "Sự giúp đỡ trực tiếp về quân sự của quân Đồng minh (Anh, Pháp).",
          "rationale": "Đúng. Quân Đồng minh (Anh, Pháp) vào Đông Dương sau đó với mục đích giải giáp quân Nhật nhưng thực chất là giúp Pháp quay lại xâm lược hoặc chống phá, không giúp đỡ cách mạng.",
          "isCorrect": true
        },
        {
          "text": "Chiến thắng của Hồng quân Liên Xô và quân Đồng minh chống phát xít.",
          "rationale": "Sai. Đây là điều kiện khách quan thuận lợi.",
          "isCorrect": false
        }
      ],
      "hint": "Hãy tìm yếu tố không xuất hiện hoặc trái ngược với thực tế lịch sử về sự hỗ trợ quốc tế trực tiếp cho cách mạng Việt Nam lúc bấy giờ."
    },
    {
      "question_number": 5,
      "question": "Theo sách giáo khoa, ý nghĩa quốc tế của Cách mạng tháng Tám năm 1945 là gì?",
      "answeroption": [
        {
          "text": "Chấm dứt sự thống trị của thực dân Pháp và phát xít Nhật tại Lào và Campuchia.",
          "rationale": "Sai. Chỉ chấm dứt tại Việt Nam, Lào và Campuchia giành độc lập ở mức độ khác nhau và sau đó Pháp quay lại.",
          "isCorrect": false
        },
        {
          "text": "Góp phần vào chiến thắng chủ nghĩa phát xít, cổ vũ các dân tộc thuộc địa đứng lên đấu tranh.",
          "rationale": "Đúng. Cách mạng tháng Tám đã chọc thủng khâu yếu nhất của hệ thống thuộc địa, cổ vũ phong trào giải phóng dân tộc trên thế giới.",
          "isCorrect": true
        },
        {
          "text": "Đưa Việt Nam trở thành ủy viên thường trực của Hội đồng Bảo an Liên hợp quốc.",
          "rationale": "Sai. Việt Nam chưa gia nhập LHQ vào thời điểm này.",
          "isCorrect": false
        },
        {
          "text": "Thiết lập quan hệ ngoại giao với tất cả các nước xã hội chủ nghĩa.",
          "rationale": "Sai. Phải đến năm 1950 Việt Nam mới thiết lập quan hệ ngoại giao với Trung Quốc, Liên Xô...",
          "isCorrect": false
        }
      ],
      "hint": "Tác động của Cách mạng tháng Tám đối với phong trào đấu tranh giải phóng dân tộc trên thế giới."
    },
    {
      "question_number": 6,
      "question": "Ngay sau Cách mạng tháng Tám, tình thế của nước Việt Nam Dân chủ Cộng hòa được ví như:",
      "answeroption": [
        {
          "text": "Nước sôi lửa bỏng.",
          "rationale": "Sai. Cụm từ này không được dùng trong SGK để mô tả giai đoạn này.",
          "isCorrect": false
        },
        {
          "text": "Ngàn cân treo sợi tóc.",
          "rationale": "Đúng. Tình thế vô cùng khó khăn do thù trong, giặc ngoài, nạn đói, nạn dốt, khó khăn tài chính.",
          "isCorrect": true
        },
        {
          "text": "Trứng để đầu đẳng.",
          "rationale": "Sai. Đây là thành ngữ tương tự nhưng không phải thuật ngữ lịch sử chính thống trong SGK.",
          "isCorrect": false
        },
        {
          "text": "Tiến thoái lưỡng nan.",
          "rationale": "Sai. Đảng ta vẫn có đường lối chủ động, không hoàn toàn bế tắc.",
          "isCorrect": false
        }
      ],
      "hint": "Cụm từ chỉ sự nguy hiểm cực độ, mong manh trước các thế lực thù địch và khó khăn chồng chất."
    },
    {
      "question_number": 7,
      "question": "Sự kiện nào đánh dấu sự mở đầu cuộc chiến tranh xâm lược Việt Nam lần thứ hai của thực dân Pháp?",
      "answeroption": [
        {
          "text": "Pháp gây hấn ở Lạng Sơn (11-1946).",
          "rationale": "Sai. Đây là sự kiện leo thang trước ngày Toàn quốc kháng chiến.",
          "isCorrect": false
        },
        {
          "text": "Pháp nổ súng đánh chiếm Sài Gòn (23-9-1945).",
          "rationale": "Đúng. Quân Pháp xả súng vào dân chúng và đánh úp trụ sở UBND Nam Bộ, mở đầu cuộc xâm lược lần 2.",
          "isCorrect": true
        },
        {
          "text": "Pháp gửi tối hậu thư đòi Chính phủ ta giải tán lực lượng tự vệ (18-12-1946).",
          "rationale": "Sai. Đây là giọt nước tràn ly dẫn đến Lời kêu gọi toàn quốc kháng chiến.",
          "isCorrect": false
        },
        {
          "text": "Quân Pháp theo chân quân Anh vào giải giáp quân Nhật (9-1945).",
          "rationale": "Sai. Đây là hành động dọn đường, sự kiện nổ súng ngày 23/9 mới là mốc mở đầu chiến tranh.",
          "isCorrect": false
        }
      ],
      "hint": "Sự kiện diễn ra tại Nam Bộ chưa đầy một tháng sau ngày Độc lập."
    },
    {
      "question_number": 8,
      "question": "Chủ tịch Hồ Chí Minh đã ra 'Lời kêu gọi toàn quốc kháng chiến' vào thời gian nào?",
      "answeroption": [
        {
          "text": "Đêm 23 tháng 9 năm 1945.",
          "rationale": "Sai. Ngày Nam Bộ kháng chiến.",
          "isCorrect": false
        },
        {
          "text": "Đêm 19 tháng 12 năm 1946.",
          "rationale": "Đúng. Đáp lại tối hậu thư và hành động xâm lược của Pháp, Chủ tịch Hồ Chí Minh đã ra lời kêu gọi này.",
          "isCorrect": true
        },
        {
          "text": "Ngày 02 tháng 9 năm 1945.",
          "rationale": "Sai. Ngày Tuyên ngôn Độc lập.",
          "isCorrect": false
        },
        {
          "text": "Ngày 06 tháng 3 năm 1946.",
          "rationale": "Sai. Ngày ký Hiệp định Sơ bộ.",
          "isCorrect": false
        }
      ],
      "hint": "Thời điểm bắt đầu cuộc kháng chiến toàn quốc lan rộng ra cả nước, đặc biệt là Hà Nội."
    },
    {
      "question_number": 9,
      "question": "Đường lối kháng chiến chống Pháp của Đảng ta được xác định là:",
      "answeroption": [
        {
          "text": "Toàn dân, toàn diện, trường kì, tự lực cánh sinh và tranh thủ sự ủng hộ quốc tế.",
          "rationale": "Đúng. Đây là nội dung cốt lõi của đường lối kháng chiến (SGK trang 40).",
          "isCorrect": true
        },
        {
          "text": "Đánh nhanh, thắng nhanh, dựa vào sự giúp đỡ của các nước xã hội chủ nghĩa.",
          "rationale": "Sai. 'Đánh nhanh thắng nhanh' là phương châm của Pháp, không phải của ta.",
          "isCorrect": false
        },
        {
          "text": "Phòng ngự chiều sâu, chờ đợi thời cơ phản công.",
          "rationale": "Sai. Đây chỉ là một phần chiến thuật trong giai đoạn đầu, không phải đường lối chung.",
          "isCorrect": false
        },
        {
          "text": "Dựa hoàn toàn vào sức mạnh quân sự của bộ đội chủ lực.",
          "rationale": "Sai. Đường lối là 'toàn dân', không chỉ dựa vào bộ đội chủ lực.",
          "isCorrect": false
        }
      ],
      "hint": "Đường lối này nhấn mạnh vào sức mạnh tổng hợp của cả dân tộc và thời gian kháng chiến lâu dài."
    },
    {
      "question_number": 10,
      "question": "Mục đích chính của cuộc chiến đấu ở các đô thị phía Bắc vĩ tuyến 16 (từ 19-12-1946) là gì?",
      "answeroption": [
        {
          "text": "Tiêu diệt hoàn toàn quân đội Pháp tại Hà Nội.",
          "rationale": "Sai. Lực lượng ta chưa đủ mạnh để tiêu diệt hoàn toàn địch lúc này.",
          "isCorrect": false
        },
        {
          "text": "Giam chân quân Pháp, tạo điều kiện cho cơ quan đầu não rút lên chiến khu an toàn.",
          "rationale": "Đúng. Mục tiêu là phá tan âm mưu 'đánh nhanh thắng nhanh' và bảo toàn lực lượng đầu não.",
          "isCorrect": true
        },
        {
          "text": "Giải phóng hoàn toàn thủ đô Hà Nội.",
          "rationale": "Sai. Phải đến năm 1954 Hà Nội mới được giải phóng.",
          "isCorrect": false
        },
        {
          "text": "Tranh thủ sự ủng hộ của quân Đồng minh.",
          "rationale": "Sai. Không phải mục đích quân sự trực tiếp của cuộc chiến đấu này.",
          "isCorrect": false
        }
      ],
      "hint": "Hành động này nhằm kéo dài thời gian để Trung ương Đảng và Chính phủ di chuyển về căn cứ địa Việt Bắc."
    },
    {
      "question_number": 11,
      "question": "Kết quả lớn nhất của chiến dịch Việt Bắc thu - đông năm 1947 là gì?",
      "answeroption": [
        {
          "text": "Giải phóng hoàn toàn vùng biên giới Việt - Trung.",
          "rationale": "Sai. Đây là kết quả của chiến dịch Biên giới 1950.",
          "isCorrect": false
        },
        {
          "text": "Làm phá sản hoàn toàn kế hoạch 'đánh nhanh, thắng nhanh' của thực dân Pháp.",
          "rationale": "Đúng. Pháp buộc phải chuyển sang 'đánh lâu dài'.",
          "isCorrect": true
        },
        {
          "text": "Buộc Pháp phải ngồi vào bàn đàm phán Giơ-ne-vơ.",
          "rationale": "Sai. Phải đến sau Điện Biên Phủ 1954.",
          "isCorrect": false
        },
        {
          "text": "Tiêu diệt toàn bộ sinh lực địch ở Bắc Bộ.",
          "rationale": "Sai. Chỉ tiêu diệt một bộ phận và bảo vệ được căn cứ địa.",
          "isCorrect": false
        }
      ],
      "hint": "Thất bại này buộc Pháp phải thay đổi chiến lược từ đánh nhanh sang đánh lâu dài."
    },
    {
      "question_number": 12,
      "question": "Chiến dịch nào đánh dấu bước ngoặt, đưa cuộc kháng chiến của ta chuyển sang giai đoạn chủ động tiến công?",
      "answeroption": [
        {
          "text": "Chiến dịch Việt Bắc thu - đông 1947.",
          "rationale": "Sai. Đây là chiến dịch phản công bảo vệ căn cứ địa.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Biên giới thu - đông 1950.",
          "rationale": "Đúng. Ta giành quyền chủ động trên chiến trường chính Bắc Bộ, khai thông biên giới.",
          "isCorrect": true
        },
        {
          "text": "Chiến dịch Điện Biên Phủ 1954.",
          "rationale": "Sai. Đây là chiến dịch quyết định kết thúc chiến tranh, diễn ra khi ta đã nắm quyền chủ động.",
          "isCorrect": false
        },
        {
          "text": "Cuộc tiến công chiến lược Đông - Xuân 1953 - 1954.",
          "rationale": "Sai. Đây là giai đoạn phát triển cao của thế chủ động.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến dịch nhằm khai thông biên giới Việt - Trung và mở rộng căn cứ địa Việt Bắc."
    },
    {
      "question_number": 13,
      "question": "Tại Đại hội đại biểu lần thứ II (tháng 2-1951), Đảng Cộng sản Đông Dương đã quyết định đổi tên thành:",
      "answeroption": [
        {
          "text": "Đảng Cộng sản Việt Nam.",
          "rationale": "Sai. Tên này có từ 1930 và sau này dùng lại, nhưng năm 1951 không dùng tên này.",
          "isCorrect": false
        },
        {
          "text": "Đảng Lao động Việt Nam.",
          "rationale": "Đúng. Đảng ra hoạt động công khai với tên gọi Đảng Lao động Việt Nam (SGK trang 41).",
          "isCorrect": false
        },
        {
          "text": "Hội nghiên cứu chủ nghĩa Mác ở Đông Dương.",
          "rationale": "Sai. Đây là tên bình phong trong giai đoạn 1945-1951.",
          "isCorrect": false
        },
        {
          "text": "Đảng Dân chủ Việt Nam.",
          "rationale": "Sai. Đây là một đảng khác trong Mặt trận Việt Minh/Liên Việt.",
          "isCorrect": false
        }
      ],
      "hint": "Tên gọi mới của Đảng năm 1951 nhấn mạnh vai trò giai cấp và tính chất dân tộc của Đảng."
    },
    {
      "question_number": 14,
      "question": "Âm mưu chính của Pháp - Mỹ trong kế hoạch Na-va (1953) là gì?",
      "answeroption": [
        {
          "text": "Kết thúc chiến tranh trong danh dự sau 18 tháng.",
          "rationale": "Đúng. Giành thắng lợi quân sự quyết định để buộc ta đàm phán theo điều kiện có lợi cho Pháp.",
          "isCorrect": true
        },
        {
          "text": "Kéo dài chiến tranh vô thời hạn để làm suy yếu Việt Nam.",
          "rationale": "Sai. Mục tiêu là kết thúc nhanh trong 18 tháng.",
          "isCorrect": false
        },
        {
          "text": "Mở rộng chiến tranh sang Lào và Campuchia.",
          "rationale": "Sai. Đây là hệ quả hành động, không phải mục tiêu bao trùm cuối cùng.",
          "isCorrect": false
        },
        {
          "text": "Rút quân hoàn toàn khỏi Đông Dương ngay lập tức.",
          "rationale": "Sai. Kế hoạch nhằm giành thế mạnh quân sự trước.",
          "isCorrect": false
        }
      ],
      "hint": "Kế hoạch này hi vọng giành một thắng lợi quân sự quyết định để rút chân khỏi cuộc chiến trong tư thế kẻ mạnh."
    },
    {
      "question_number": 15,
      "question": "Để phá tan kế hoạch Na-va, chủ trương chiến lược của Đảng ta trong Đông - Xuân 1953 - 1954 là gì?",
      "answeroption": [
        {
          "text": "Tập trung lực lượng tấn công trực diện vào Hà Nội.",
          "rationale": "Sai. Hà Nội là nơi địch mạnh, không phù hợp phương châm tránh chỗ mạnh.",
          "isCorrect": false
        },
        {
          "text": "Tấn công vào những hướng quan trọng về chiến lược mà địch tương đối yếu.",
          "rationale": "Đúng. Nhằm buộc địch phải phân tán lực lượng đối phó (SGK trang 43).",
          "isCorrect": true
        },
        {
          "text": "Dồn toàn bộ lực lượng lên đánh Điện Biên Phủ ngay từ đầu.",
          "rationale": "Sai. Điện Biên Phủ ban đầu không có trong kế hoạch Na-va, sau mới thành điểm quyết chiến.",
          "isCorrect": false
        },
        {
          "text": "Phòng ngự chặt chẽ ở Việt Bắc, chờ địch đến để tiêu diệt.",
          "rationale": "Sai. Ta chủ động tiến công, không thụ động phòng ngự.",
          "isCorrect": false
        }
      ],
      "hint": "Phương châm 'tránh chỗ mạnh, đánh chỗ yếu' để điều động địch phân tán lực lượng."
    },
    {
      "question_number": 16,
      "question": "Chiến thắng nào đã trực tiếp dẫn đến việc ký kết Hiệp định Giơ-ne-vơ năm 1954?",
      "answeroption": [
        {
          "text": "Chiến thắng Biên giới thu - đông 1950.",
          "rationale": "Sai. Đây là chiến thắng khai thông biên giới.",
          "isCorrect": false
        },
        {
          "text": "Chiến thắng Điện Biên Phủ.",
          "rationale": "Đúng. Chiến thắng này đập tan ý chí xâm lược của Pháp, làm xoay chuyển cục diện chiến tranh.",
          "isCorrect": true
        },
        {
          "text": "Chiến thắng Đông - Xuân 1953 - 1954.",
          "rationale": "Sai. Đây là chuỗi chiến thắng tạo đà, nhưng Điện Biên Phủ mới là đòn quyết định cuối cùng.",
          "isCorrect": false
        },
        {
          "text": "Cuộc tiến công ở Tây Nguyên.",
          "rationale": "Sai. Sự kiện này thuộc giai đoạn sau hoặc là một phần nhỏ của Đông Xuân.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến thắng 'lừng lẫy năm châu, chấn động địa cầu'."
    },
    {
      "question_number": 17,
      "question": "Nội dung nào dưới đây phản ánh đúng vai trò của hậu phương trong cuộc kháng chiến chống Pháp (1945-1954)?",
      "answeroption": [
        {
          "text": "Là yếu tố quyết định nhất để giành thắng lợi quân sự.",
          "rationale": "Sai. Yếu tố quyết định nhất thường là đường lối lãnh đạo, hậu phương là nhân tố thường xuyên.",
          "isCorrect": false
        },
        {
          "text": "Cung cấp sức người, sức của cho tiền tuyến.",
          "rationale": "Đúng. Xây dựng hậu phương vững mạnh về mọi mặt để chi viện cho tiền tuyến (SGK trang 44).",
          "isCorrect": true
        },
        {
          "text": "Trực tiếp tham gia các trận đánh lớn tiêu diệt địch.",
          "rationale": "Sai. Nhiệm vụ chiến đấu là của tiền tuyến (tuy nhiên hậu phương cũng có chiến tranh du kích, nhưng vai trò chính là chi viện).",
          "isCorrect": false
        },
        {
          "text": "Quyết định việc ký kết các hiệp định ngoại giao.",
          "rationale": "Sai. Đây là vai trò của mặt trận ngoại giao và lãnh đạo Đảng/Nhà nước.",
          "isCorrect": false
        }
      ],
      "hint": "Nơi cung cấp lương thực, thực phẩm, vũ khí và nhân lực cho chiến trường."
    },
    {
      "question_number": 18,
      "question": "Phương châm tác chiến của chiến dịch Điện Biên Phủ đã được thay đổi như thế nào?",
      "answeroption": [
        {
          "text": "Từ 'đánh nhanh, thắng nhanh' sang 'đánh chắc, tiến chắc'.",
          "rationale": "Đúng. Do đánh giá lại tình hình địch tăng cường phòng ngự kiên cố (SGK trang 43).",
          "isCorrect": true
        },
        {
          "text": "Từ 'đánh chắc, tiến chắc' sang 'đánh nhanh, thắng nhanh'.",
          "rationale": "Sai. Ngược lại mới đúng.",
          "isCorrect": false
        },
        {
          "text": "Từ 'đánh du kích' sang 'đánh vận động'.",
          "rationale": "Sai. Đây là hình thức chiến thuật, không phải phương châm chiến dịch cụ thể này.",
          "isCorrect": false
        },
        {
          "text": "Từ 'đánh điểm, diệt viện' sang 'tổng công kích'.",
          "rationale": "Sai. Không phải nội dung thay đổi phương châm tại Điện Biên Phủ.",
          "isCorrect": false
        }
      ],
      "hint": "Sự thay đổi này nhằm đảm bảo 'chắc thắng' khi Pháp đã xây dựng Điện Biên Phủ thành tập đoàn cứ điểm mạnh."
    },
    {
      "question_number": 19,
      "question": "Ý nghĩa lịch sử quan trọng nhất của Hiệp định Giơ-ne-vơ năm 1954 là gì?",
      "answeroption": [
        {
          "text": "Các nước tham dự hội nghị cam kết tôn trọng các quyền dân tộc cơ bản của ba nước Đông Dương.",
          "rationale": "Đúng. Bao gồm độc lập, chủ quyền, thống nhất và toàn vẹn lãnh thổ (SGK trang 44).",
          "isCorrect": true
        },
        {
          "text": "Quân đội Pháp phải rút khỏi miền Nam Việt Nam ngay lập tức.",
          "rationale": "Sai. Pháp rút dần và có thời hạn chuyển quân.",
          "isCorrect": false
        },
        {
          "text": "Việt Nam được thống nhất ngay sau khi ký hiệp định.",
          "rationale": "Sai. Việt Nam tạm thời bị chia cắt và dự kiến tổng tuyển cử sau 2 năm.",
          "isCorrect": false
        },
        {
          "text": "Mỹ cam kết không can thiệp vào Đông Dương.",
          "rationale": "Sai. Mỹ không ký vào tuyên bố cuối cùng và sau đó nhảy vào thay chân Pháp.",
          "isCorrect": false
        }
      ],
      "hint": "Văn bản pháp lý quốc tế đầu tiên ghi nhận đầy đủ các quyền độc lập, chủ quyền, thống nhất và toàn vẹn lãnh thổ của Việt Nam."
    },
    {
      "question_number": 20,
      "question": "Nguyên nhân chủ quan quan trọng nhất dẫn đến thắng lợi của cuộc kháng chiến chống thực dân Pháp (1945 - 1954) là gì?",
      "answeroption": [
        {
          "text": "Sự ủng hộ của các nước xã hội chủ nghĩa.",
          "rationale": "Sai. Đây là nguyên nhân khách quan.",
          "isCorrect": false
        },
        {
          "text": "Sự lãnh đạo sáng suốt của Đảng, đứng đầu là Chủ tịch Hồ Chí Minh.",
          "rationale": "Đúng. Với đường lối chính trị, quân sự đúng đắn là nhân tố quyết định hàng đầu (SGK trang 44).",
          "isCorrect": true
        },
        {
          "text": "Tinh thần đoàn kết chiến đấu của ba nước Đông Dương.",
          "rationale": "Sai. Đây là một nguyên nhân quan trọng nhưng sự lãnh đạo của Đảng mới là then chốt nhất.",
          "isCorrect": false
        },
        {
          "text": "Sự suy yếu của thực dân Pháp sau Chiến tranh thế giới thứ hai.",
          "rationale": "Sai. Đây là điều kiện thuận lợi khách quan.",
          "isCorrect": false
        }
      ],
      "hint": "Yếu tố dẫn đường, vạch ra đường lối kháng chiến đúng đắn."
    },
    {
      "question_number": 21,
      "question": "Trong Cách mạng tháng Tám năm 1945, lệnh Tổng khởi nghĩa được ban bố trong văn kiện nào?",
      "answeroption": [
        {
          "text": "Chỉ thị 'Nhật - Pháp bắn nhau và hành động của chúng ta'.",
          "rationale": "Sai. Chỉ thị này ra đời tháng 3/1945 để phát động cao trào kháng Nhật.",
          "isCorrect": false
        },
        {
          "text": "Quân lệnh số 1 của Ủy ban Khởi nghĩa toàn quốc.",
          "rationale": "Đúng. Ban bố đêm 13-8-1945 (SGK trang 34).",
          "isCorrect": true
        },
        {
          "text": "Tuyên ngôn Độc lập.",
          "rationale": "Sai. Văn kiện này tuyên bố sau khi khởi nghĩa thành công.",
          "isCorrect": false
        },
        {
          "text": "Lời kêu gọi toàn quốc kháng chiến.",
          "rationale": "Sai. Văn kiện này thuộc giai đoạn chống Pháp năm 1946.",
          "isCorrect": false
        }
      ],
      "hint": "Văn kiện này có nội dung: 'Giờ tổng khởi nghĩa đã đánh... Dưới mệnh lệnh của Ủy ban chỉ huy, hãy nhất tề đứng dậy...'."
    },
    {
      "question_number": 22,
      "question": "Nội dung nào sau đây phản ánh đúng về tính chất của Cách mạng tháng Tám năm 1945?",
      "answeroption": [
        {
          "text": "Là cuộc cách mạng tư sản dân quyền.",
          "rationale": "Sai. Cách mạng tháng Tám mang tính chất dân tộc dân chủ nhân dân, không phải tư sản kiểu cũ.",
          "isCorrect": false
        },
        {
          "text": "Là cuộc cách mạng giải phóng dân tộc điển hình.",
          "rationale": "Đúng. Mục tiêu hàng đầu là giành độc lập dân tộc, lật đổ ách thống trị của thực dân, phong kiến (SGK trang 36 phân tích ý nghĩa).",
          "isCorrect": true
        },
        {
          "text": "Là cuộc cách mạng xã hội chủ nghĩa.",
          "rationale": "Sai. Giai đoạn này chưa tiến lên CNXH ngay.",
          "isCorrect": false
        },
        {
          "text": "Là cuộc nội chiến cách mạng.",
          "rationale": "Sai. Đây là cuộc khởi nghĩa giành chính quyền từ tay ngoại bang và tay sai, không đơn thuần là nội chiến.",
          "isCorrect": false
        }
      ],
      "hint": "Nhiệm vụ hàng đầu của cuộc cách mạng này là đánh đuổi xâm lược, giành lại độc lập."
    },
    {
      "question_number": 23,
      "question": "Sự kiện nào diễn ra vào ngày 19-8-1945 có ý nghĩa quyết định đến thắng lợi của Cách mạng tháng Tám?",
      "answeroption": [
        {
          "text": "Khởi nghĩa giành chính quyền ở Huế.",
          "rationale": "Sai. Huế là ngày 23/8.",
          "isCorrect": false
        },
        {
          "text": "Khởi nghĩa giành chính quyền thắng lợi ở Hà Nội.",
          "rationale": "Đúng. Thắng lợi ở thủ đô tạo đà tâm lý và vị thế cho cả nước (SGK trang 35).",
          "isCorrect": true
        },
        {
          "text": "Khởi nghĩa giành chính quyền ở Sài Gòn.",
          "rationale": "Sai. Sài Gòn là ngày 25/8.",
          "isCorrect": false
        },
        {
          "text": "Vua Bảo Đại thoái vị.",
          "rationale": "Sai. Sự kiện này diễn ra ngày 30/8.",
          "isCorrect": false
        }
      ],
      "hint": "Cuộc mít tinh lớn tại Nhà hát Lớn đã biến thành cuộc biểu tình đánh chiếm Phủ Khâm sai."
    },
    {
      "question_number": 24,
      "question": "Chiến thắng nào của quân dân ta trong cuộc kháng chiến chống Pháp được ví như 'Cái mốc bằng vàng'?",
      "answeroption": [
        {
          "text": "Chiến thắng Việt Bắc 1947.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Chiến thắng Điện Biên Phủ 1954.",
          "rationale": "Đúng. Cụm từ này thường dùng để ca ngợi tầm vóc vĩ đại của Điện Biên Phủ (kết thúc ách thống trị thực dân).",
          "isCorrect": true
        },
        {
          "text": "Chiến thắng Biên giới 1950.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Cuộc tiến công Đông Xuân 1953-1954.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Thắng lợi này được đánh giá là đã 'ghi tên vào lịch sử dân tộc như một Bạch Đằng, một Chi Lăng...'."
    },
    {
      "question_number": 25,
      "question": "Trong chiến dịch Điện Biên Phủ, tướng Pháp nào đã bị bắt sống?",
      "answeroption": [
        {
          "text": "Lơ-c莱c (Leclerc).",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Đờ Ca-xtơ-ri (De Castries).",
          "rationale": "Đúng. Chiều 7-5-1954, tướng Đờ Ca-xtơ-ri cùng toàn bộ Bộ tham mưu bị bắt sống (SGK trang 43).",
          "isCorrect": true
        },
        {
          "text": "Na-va (Navarre).",
          "rationale": "Sai. Na-va là tổng chỉ huy ở Đông Dương, không trực tiếp chỉ huy tại hầm Điện Biên Phủ.",
          "isCorrect": false
        },
        {
          "text": "Đờ Lát đơ Tát-xi-nhi (De Lattre de Tassigny).",
          "rationale": "Sai. Ông này đã về nước và mất trước đó.",
          "isCorrect": false
        }
      ],
      "hint": "Viên tướng chỉ huy tập đoàn cứ điểm Điện Biên Phủ."
    },
    {
      "question_number": 26,
      "question": "Kết quả nào KHÔNG thuộc về Chiến dịch Biên giới thu - đông năm 1950?",
      "answeroption": [
        {
          "text": "Giải phóng vùng biên giới Việt - Trung từ Cao Bằng đến Đình Lập.",
          "rationale": "Sai. Đây là kết quả đúng.",
          "isCorrect": false
        },
        {
          "text": "Chọc thủng 'Hành lang Đông - Tây' của Pháp.",
          "rationale": "Sai. Đây là kết quả đúng.",
          "isCorrect": false
        },
        {
          "text": "Buộc Pháp phải ký Hiệp định Giơ-ne-vơ.",
          "rationale": "Đúng. Sự kiện này diễn ra năm 1954 sau Điện Biên Phủ, không phải sau chiến dịch Biên giới 1950.",
          "isCorrect": true
        },
        {
          "text": "Khai thông đường liên lạc với các nước xã hội chủ nghĩa.",
          "rationale": "Sai. Đây là kết quả đúng.",
          "isCorrect": false
        }
      ],
      "hint": "Hãy tìm kết quả thuộc về giai đoạn cuối cuộc kháng chiến (1954) chứ không phải năm 1950."
    },
    {
      "question_number": 27,
      "question": "Bài học kinh nghiệm về 'thời cơ' trong Cách mạng tháng Tám năm 1945 là:",
      "answeroption": [
        {
          "text": "Chủ động tạo thời cơ và kịp thời chớp thời cơ.",
          "rationale": "Đúng. Đảng ta đã chuẩn bị lực lượng (tạo thời cơ) và khi Nhật đầu hàng (thời cơ đến) đã phát động khởi nghĩa ngay (SGK trang 36).",
          "isCorrect": true
        },
        {
          "text": "Chỉ cần chờ đợi thời cơ đến là hành động.",
          "rationale": "Sai. Nếu không chuẩn bị (chủ động) thì thời cơ đến cũng không làm gì được.",
          "isCorrect": false
        },
        {
          "text": "Tranh thủ sự giúp đỡ của bên ngoài để tạo thời cơ.",
          "rationale": "Sai. Nội lực là chính.",
          "isCorrect": false
        },
        {
          "text": "Tiến hành khởi nghĩa ở bất cứ thời điểm nào khi lực lượng đã mạnh.",
          "rationale": "Sai. Phải đúng thời cơ (kẻ thù hoang mang, quần chúng sẵn sàng) mới giảm thiểu đổ máu.",
          "isCorrect": false
        }
      ],
      "hint": "Sự kết hợp giữa chuẩn bị chu đáo bên trong và nắm bắt điều kiện khách quan bên ngoài."
    },
    {
      "question_number": 28,
      "question": "Thắng lợi của Cách mạng tháng Tám năm 1945 đã mở ra kỉ nguyên mới nào cho dân tộc Việt Nam?",
      "answeroption": [
        {
          "text": "Kỉ nguyên độc lập, tự do và đi lên chủ nghĩa xã hội.",
          "rationale": "Sai. Cụm từ 'đi lên chủ nghĩa xã hội' chính xác hơn cho giai đoạn sau 1975 hoặc miền Bắc sau 1954. Cách mạng tháng 8 mở ra kỉ nguyên độc lập, tự do, nhân dân làm chủ.",
          "isCorrect": false
        },
        {
          "text": "Kỉ nguyên độc lập, tự do, nhân dân lao động làm chủ đất nước.",
          "rationale": "Đúng. Theo SGK trang 36: 'mở ra kỉ nguyên mới trong lịch sử dân tộc: kỉ nguyên độc lập, tự do, nhân dân lao động làm chủ đất nước'.",
          "isCorrect": true
        },
        {
          "text": "Kỉ nguyên hội nhập và phát triển toàn diện.",
          "rationale": "Sai. Đây là giai đoạn Đổi mới sau này.",
          "isCorrect": false
        },
        {
          "text": "Kỉ nguyên công nghiệp hóa, hiện đại hóa.",
          "rationale": "Sai. Đây là nhiệm vụ của giai đoạn sau.",
          "isCorrect": false
        }
      ],
      "hint": "Từ thân phận nô lệ, người dân Việt Nam đã trở thành người chủ của đất nước."
    },
    {
      "question_number": 29,
      "question": "Trong những năm 1951 - 1953, mặt trận nào được thành lập nhằm tăng cường khối đoàn kết ba nước Đông Dương?",
      "answeroption": [
        {
          "text": "Mặt trận Việt Minh.",
          "rationale": "Sai. Đây là mặt trận của riêng Việt Nam (giai đoạn trước).",
          "isCorrect": false
        },
        {
          "text": "Mặt trận Liên Việt.",
          "rationale": "Sai. Đây là mặt trận hợp nhất Việt Minh và Hội Liên Việt của Việt Nam.",
          "isCorrect": false
        },
        {
          "text": "Liên minh nhân dân Việt - Miên - Lào.",
          "rationale": "Đúng. Được thành lập tháng 3-1951 để tăng cường đoàn kết 3 nước (SGK trang 41).",
          "isCorrect": true
        },
        {
          "text": "Mặt trận Dân chủ Đông Dương.",
          "rationale": "Sai. Đây là mặt trận giai đoạn 1936-1939.",
          "isCorrect": false
        }
      ],
      "hint": "Tổ chức liên minh chiến đấu giữa nhân dân Việt Nam, Campuchia (Miên) và Lào."
    },
    {
      "question_number": 30,
      "question": "Ngày 19-12-1946, sự kiện lịch sử nào đã diễn ra?",
      "answeroption": [
        {
          "text": "Pháp tấn công lên Việt Bắc.",
          "rationale": "Sai. Việt Bắc là năm 1947.",
          "isCorrect": false
        },
        {
          "text": "Chủ tịch Hồ Chí Minh ra Lời kêu gọi toàn quốc kháng chiến.",
          "rationale": "Đúng. Đánh dấu sự bắt đầu cuộc kháng chiến toàn quốc.",
          "isCorrect": true
        },
        {
          "text": "Đại hội đại biểu lần thứ II của Đảng.",
          "rationale": "Sai. Đại hội II là năm 1951.",
          "isCorrect": false
        },
        {
          "text": "Chiến thắng Điện Biên Phủ.",
          "rationale": "Sai. Điện Biên Phủ là năm 1954.",
          "isCorrect": false
        }
      ],
      "hint": "Sự kiện mở đầu cho 9 năm kháng chiến chống Pháp."
    },
    {
      "question_number": 31,
      "question": "Nội dung nào sau đây thể hiện tính chất 'nhân văn' trong chính sách của Việt Minh đối với quân đội Nhật sau khi Nhật đầu hàng?",
      "answeroption": [
        {
          "text": "Tiêu diệt toàn bộ quân Nhật còn sót lại.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Khoan hồng với tù binh, tạo điều kiện cho họ hồi hương.",
          "rationale": "Đúng. Chính sách của ta là thêm bạn bớt thù, nhân đạo với kẻ thù đã đầu hàng.",
          "isCorrect": true
        },
        {
          "text": "Giam giữ vô thời hạn để làm con tin.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Giao nộp ngay cho quân Đồng minh xét xử.",
          "rationale": "Sai. Ta chủ động xử lý tình huống linh hoạt.",
          "isCorrect": false
        }
      ],
      "hint": "Chính sách thể hiện sự khoan dung và yêu chuộng hòa bình của dân tộc ta."
    },
    {
      "question_number": 32,
      "question": "Trong chiến dịch Điện Biên Phủ, khẩu hiệu nào thể hiện quyết tâm cao nhất của quân và dân ta?",
      "answeroption": [
        {
          "text": "Quyết tử để Tổ quốc quyết sinh.",
          "rationale": "Sai. Đây là khẩu hiệu của chiến sĩ Hà Nội mùa đông năm 1946.",
          "isCorrect": false
        },
        {
          "text": "Quyết chiến, quyết thắng.",
          "rationale": "Đúng. Lá cờ 'Quyết chiến quyết thắng' đã được trao cho các đơn vị lập công và cắm trên hầm Đờ Ca-xtơ-ri (SGK trang 43).",
          "isCorrect": true
        },
        {
          "text": "Thà hy sinh tất cả chứ nhất định không chịu mất nước.",
          "rationale": "Sai. Đây là trích Lời kêu gọi toàn quốc kháng chiến 1946.",
          "isCorrect": false
        },
        {
          "text": "Xẻ dọc Trường Sơn đi cứu nước.",
          "rationale": "Sai. Đây là khẩu hiệu thời chống Mỹ.",
          "isCorrect": false
        }
      ],
      "hint": "Dòng chữ được thêu trên lá cờ trao thưởng luân lưu của Bác Hồ trong chiến dịch."
    },
    {
      "question_number": 33,
      "question": "Vai trò của lực lượng vũ trang trong Cách mạng tháng Tám 1945 là gì?",
      "answeroption": [
        {
          "text": "Lực lượng đông đảo nhất, quyết định thắng lợi.",
          "rationale": "Sai. Lực lượng chính trị mới là đông đảo nhất.",
          "isCorrect": false
        },
        {
          "text": "Lực lượng nòng cốt, hỗ trợ lực lượng chính trị.",
          "rationale": "Sai. Trong Cách mạng tháng 8, lực lượng vũ trang đóng vai trò xung kích, hỗ trợ lực lượng chính trị (lực lượng chính trị đóng vai trò quyết định chủ yếu).",
          "isCorrect": true
        },
        {
          "text": "Chỉ làm nhiệm vụ bảo vệ cơ quan đầu não.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Không tham gia trực tiếp vào việc giành chính quyền.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Lực lượng xung kích, làm đòn bẩy cho quần chúng nổi dậy."
    },
    {
      "question_number": 34,
      "question": "Chiến thắng nào của ta đã làm thất bại âm mưu 'dùng người Việt đánh người Việt, lấy chiến tranh nuôi chiến tranh' của Pháp?",
      "answeroption": [
        {
          "text": "Các chiến dịch ở đồng bằng Bắc Bộ (1951-1953).",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Chiến cuộc Đông - Xuân 1953 - 1954 và Điện Biên Phủ.",
          "rationale": "Đúng. Đánh bại ý chí xâm lược và các kế hoạch quân sự của Pháp (vốn dựa trên việc huy động nhân lực, vật lực tại chỗ).",
          "isCorrect": true
        },
        {
          "text": "Chiến dịch Việt Bắc 1947.",
          "rationale": "Sai. Lúc này Pháp chưa hoàn thiện chính sách dùng người Việt đánh người Việt.",
          "isCorrect": false
        },
        {
          "text": "Cuộc chiến đấu ở các đô thị 1946.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Thắng lợi cuối cùng buộc Pháp phải ký Hiệp định Giơ-ne-vơ, chấm dứt hoàn toàn sự thống trị."
    },
    {
      "question_number": 35,
      "question": "Thắng lợi của cuộc kháng chiến chống Pháp (1945-1954) đã:",
      "answeroption": [
        {
          "text": "Hoàn thành cuộc cách mạng dân tộc dân chủ nhân dân trên cả nước.",
          "rationale": "Sai. Mới chỉ giải phóng miền Bắc.",
          "isCorrect": false
        },
        {
          "text": "Giải phóng miền Bắc, tạo cơ sở để giải phóng hoàn toàn miền Nam.",
          "rationale": "Đúng. Miền Bắc được giải phóng, đi lên CNXH, làm hậu phương lớn cho tiền tuyến miền Nam (SGK trang 45).",
          "isCorrect": true
        },
        {
          "text": "Đánh bại hoàn toàn chiến lược toàn cầu của đế quốc Mỹ.",
          "rationale": "Sai. Chỉ đánh bại một bước can thiệp của Mỹ.",
          "isCorrect": false
        },
        {
          "text": "Xóa bỏ hoàn toàn giai cấp bóc lột trên cả nước.",
          "rationale": "Sai. Miền Nam vẫn còn dưới ách thống trị của Mỹ - Diệm.",
          "isCorrect": false
        }
      ],
      "hint": "Kết quả trực tiếp đối với vùng lãnh thổ từ vĩ tuyến 17 trở ra Bắc."
    }
  ]
}
